#ifndef Z2_H
#define Z2_H

#include <n64.h>
#include "types.h"

#define Z2_SCREEN_WIDTH      320
#define Z2_SCREEN_HEIGHT     240

/**
 * Correlates to form field in z2_file_t.
 **/
typedef enum {
    Z2_FORM_FIERCE_DEITY,
    Z2_FORM_GORON,
    Z2_FORM_ZORA,
    Z2_FORM_DEKU,
    Z2_FORM_HUMAN,
} z2_form_t;

typedef enum {
    Z2_TIMESPEED_NORMAL,
    Z2_TIMESPEED_STOPPED = 0xFFFFFFFD,
    Z2_TIMESPEED_INVERTED = 0xFFFFFFFE,
} z2_timespeed_t;

typedef enum {
    // 0x00 (Inventory)
    Z2_ITEM_OCARINA,
    Z2_ITEM_BOW,
    Z2_ITEM_FIRE_ARROW,
    Z2_ITEM_ICE_ARROW,
    Z2_ITEM_LIGHT_ARROW,
    Z2_ITEM_FAIRY_OCARINA,
    Z2_ITEM_BOMB,
    Z2_ITEM_BOMBCHU,
    Z2_ITEM_DEKU_STICK,
    Z2_ITEM_DEKU_NUT,
    Z2_ITEM_MAGIC_BEAN,
    Z2_ITEM_SLINGSHOT,
    Z2_ITEM_POWDER_KEG,
    Z2_ITEM_PICTOGRAPH,
    Z2_ITEM_LENS,
    Z2_ITEM_HOOKSHOT,
    Z2_ITEM_FAIRY_SWORD,
    Z2_ITEM_HOOKSHOT_OOT,

    // 0x12 (Bottle)
    Z2_ITEM_EMPTY_BOTTLE,
    Z2_ITEM_RED_POTION,
    Z2_ITEM_GREEN_POTION,
    Z2_ITEM_BLUE_POTION,
    Z2_ITEM_FAIRY,
    Z2_ITEM_DEKU_PRINCESS,
    Z2_ITEM_MILK,
    Z2_ITEM_MILK_HALF,
    Z2_ITEM_FISH,
    Z2_ITEM_BUGS,
    Z2_ITEM_BLUE_FIRE,
    Z2_ITEM_POE,
    Z2_ITEM_BIG_POE,
    Z2_ITEM_WATER,
    Z2_ITEM_HOT_WATER,
    Z2_ITEM_ZORA_EGG,
    Z2_ITEM_GOLD_DUST,
    Z2_ITEM_MUSHROOM,
    Z2_ITEM_SEAHORSE,
    Z2_ITEM_CHATEAU_ROMANI,
    Z2_ITEM_EEL,
    Z2_ITEM_EMPTY_BOTTLE_2,

    // 0x28 (Quest)
    Z2_ITEM_MOON_TEAR,
    Z2_ITEM_TOWN_DEED,
    Z2_ITEM_SWAMP_DEED,

    Z2_CAMERA_STATE_BOSS_LAST,
    Z2_CAMERA_STATE_BOSS_INI,
    Z2_CAMERA_STATE_BOSS_HAK,
    Z2_CAMERA_STATE_BOSS_KON,
    Z2_CAMERA_STATE_CONNECT0,
    Z2_CAMERA_STATE_MORAY,
    Z2_CAMERA_STATE_NORMAL2,
    Z2_CAMERA_STATE_BOMBBOWL,
    Z2_CAMERA_STATE_CIRCLEa,
    Z2_CAMERA_STATE_WHIRLPOOL,
    Z2_CAMERA_STATE_KOKKOGAME,
    Z2_CAMERA_STATE_GIANT,
    Z2_CAMERA_STATE_SCENE0,
    Z2_CAMERA_STATE_ROOM1,
    Z2_CAMERA_STATE_WATER2,
    Z2_CAMERA_STATE_SOKONASI,
    Z2_CAMERA_STATE_FORCEKEEP,
    Z2_CAMERA_STATE_PARALLEL1,
    Z2_CAMERA_STATE_START1,
    Z2_CAMERA_STATE_ROOM2,
    Z2_CAMERA_STATE_NORMAL4,
    Z2_CAMERA_STATE_SHELL,
    Z2_CAMERA_STATE_DUNGEON4,
} z2_camera_state;

typedef enum {
    Z2_CAMERA_MODE_NORMAL,
    Z2_CAMERA_MODE_JUMP,
    Z2_CAMERA_MODE_GORONDASH,
    Z2_CAMERA_MODE_NUTSSHOT,
    Z2_CAMERA_MODE_BOWARROWZ,
    Z2_CAMERA_MODE_NUTSFLY,
    Z2_CAMERA_MODE_SUBJECT,
    Z2_CAMERA_MODE_BOOKEEPON,
    Z2_CAMERA_MODE_ZORAFIN,
    Z2_CAMERA_MODE_KEEPON,
    Z2_CAMERA_MODE_PARALLEL,
    Z2_CAMERA_MODE_TALK,
    Z2_CAMERA_MODE_PACHINCO,
    Z2_CAMERA_MODE_BOWARROW,
    Z2_CAMERA_MODE_BATTLE,
    Z2_CAMERA_MODE_NUTSHIDE,
    Z2_CAMERA_MODE_STILL,
    Z2_CAMERA_MODE_CHARGE,
    Z2_CAMERA_MODE_CLIMB,
    Z2_CAMERA_MODE_CLIMBZ,
    Z2_CAMERA_MODE_FOOKSHOT,
    Z2_CAMERA_MODE_FREEFALL,
    Z2_CAMERA_MODE_HANG,
    Z2_CAMERA_MODE_HANGZ,
    Z2_CAMERA_MODE_PUSHPULL,
    Z2_CAMERA_MODE_NUTSFLYZ,
    Z2_CAMERA_MODE_GORONJUMP,
    Z2_CAMERA_MODE_BOOMERANG,
    Z2_CAMERA_MODE_CHARGEZ,
    Z2_CAMERA_MODE_ZORAFINZ,
} z2_camera_mode;

typedef enum {
    // No timer.
    Z2_TIMER_STATE_NONE,
    // Timer is not being displayed yet.
    Z2_TIMER_STATE_PRE,
    // Timer is in middle of screen.
    Z2_TIMER_STATE_INIT,
    // Timer is moving into position.
    Z2_TIMER_STATE_MOVING,
    // Timer is positioned.
    Z2_TIMER_STATE_SET,
    // Timer is finished and no longer displaying.
    Z2_TIMER_STATE_FINISHED,
} z2_timer_state_t;

/* Macro for checking if a timer state is visible. */
#define IS_TIMER_VISIBLE(TSTATE) (Z2_TIMER_STATE_INIT <= (TSTATE) && (TSTATE) < Z2_TIMER_STATE_FINISHED)

typedef enum {
    // Skull kid on clock tower.
    Z2_TIMER_TYPE_SKULL_KID = 3,
    // Treasure chest game, maybe others.
    Z2_TIMER_TYPE_TCG = 4,
    // Drowning.
    Z2_TIMER_TYPE_DROWNING = 5,
    // None.
    Z2_TIMER_TYPE_NONE = 0x63,
} z2_timer_type_t;

typedef enum {
    // Poe sisters fight.
    Z2_TIMER_INDEX_POE_SISTERS = 1,
    // Treasure Chest Shop game.
    Z2_TIMER_INDEX_TREASURE_CHEST_GAME = 4,
    // Drowning.
    Z2_TIMER_INDEX_DROWNING = 5,
    // Clock tower skull kid encounter.
    Z2_TIMER_INDEX_SKULL_KID = 0x13,
    // Honey & Darling game.
    Z2_TIMER_INDEX_HONEY_DARLING = 0x14,
} z2_timer_index_t;

enum z2_button_text {
    Z2_BUTTON_TEXT_DECIDE = 6,
    Z2_BUTTON_TEXT_INFO = 0x15,
};

/* Structure type aliases. */
typedef struct z2_actor_s z2_actor_t;
typedef struct z2_game_s  z2_game_t;

/**
 * Floating point matrix (copied from krimtonz' gu.h)
 **/
typedef union {
    f32 mf[4][4];
    f32 f[16];
    struct {
        f32 xx, xy, xz, xw,
            yx, yy, yz, yw,
            zx, zy, zz, zw,
            wx, wy, wz, ww;
    };
} MtxF;

/// =============================================================
/// Position & Rotation
/// =============================================================

typedef struct {
    s16              x;                              /* 0x0000 */
    s16              y;                              /* 0x0002 */
    s16              z;                              /* 0x0004 */
} z2_xyz_t;                                          /* 0x0006 */

typedef struct {
    f32              x;                              /* 0x0000 */
    f32              y;                              /* 0x0004 */
    f32              z;                              /* 0x0008 */
} z2_xyzf_t;                                         /* 0x000C */

typedef u16 z2_angle_t;
typedef struct {
    z2_angle_t       x;                              /* 0x0000 */
    z2_angle_t       y;                              /* 0x0002 */
    z2_angle_t       z;                              /* 0x0004 */
} z2_rot_t;                                          /* 0x0006 */

/// =============================================================
/// Colors
/// =============================================================

typedef struct {
    union {
        u8           bytes[3];                       /* 0x0000 */
        struct {
            u8       r;                              /* 0x0000 */
            u8       g;                              /* 0x0001 */
            u8       b;                              /* 0x0002 */
        };
    };
    u8               padding;                        /* 0x0003 */
} z2_color_rgb8_t;                                   /* 0x0004 */

typedef struct {
    union {
        u8           bytes[4];                       /* 0x0000 */
        struct {
            u8       r;                              /* 0x0000 */
            u8       g;                              /* 0x0001 */
            u8       b;                              /* 0x0002 */
            u8       a;                              /* 0x0003 */
        };
    };
} z2_color_rgba8_t;                                  /* 0x0004 */

typedef struct {
    union {
        u16          words[3];                       /* 0x0000 */
        struct {
            u16      r;                              /* 0x0000 */
            u16      g;                              /* 0x0002 */
            u16      b;                              /* 0x0004 */
        };
    };
} z2_color_rgb16_t;                                  /* 0x0006 */

typedef struct {
    union {
        u16          words[6];                       /* 0x0000 */
        struct {
            u16      r1;                             /* 0x0000 */
            u16      r2;                             /* 0x0002 */
            u16      g1;                             /* 0x0004 */
            u16      g2;                             /* 0x0006 */
            u16      b1;                             /* 0x0008 */
            u16      b2;                             /* 0x000A */
        };
    };
} z2_color_rgb16_2_t;                                /* 0x000C */

/// =============================================================
/// Controller & Inputs
/// =============================================================

typedef union {
    struct {
        u16          a  : 1;
        u16          b  : 1;
        u16          z  : 1;
        u16          s  : 1;
        u16          du : 1;
        u16          dd : 1;
        u16          dl : 1;
        u16          dr : 1;
        u16             : 2;
        u16          l  : 1;
        u16          r  : 1;
        u16          cu : 1;
        u16          cd : 1;
        u16          cl : 1;
        u16          cr : 1;
    };
    u16              pad;                            /* 0x0000 */
} z2_pad_t;                                          /* 0x0002 */

typedef struct {
    z2_pad_t         pad;                            /* 0x0000 */
    s8               x;                              /* 0x0002 */
    s8               y;                              /* 0x0003 */
} z2_controller_t;                                   /* 0x0004 */

typedef struct {
    z2_controller_t  raw;                            /* 0x0000 */
    u16              status;                         /* 0x0004 */
    z2_controller_t  raw_prev;                       /* 0x0006 */
    u16              status_prev;                    /* 0x000A */
    z2_pad_t         pad_pressed;                    /* 0x000C */
    s8               x_diff;                         /* 0x000E */
    s8               y_diff;                         /* 0x000F */
    u8               unk_0x10[0x02];                 /* 0x0010 */
    z2_pad_t         pad_released;                   /* 0x0012 */
    s8               adjusted_x;                     /* 0x0014 */
    s8               adjusted_y;                     /* 0x0015 */
    u8               unk_0x16[0x02];                 /* 0x0016 */
} z2_input_t;                                        /* 0x0018 */

/// =============================================================
/// Gfx Context
/// =============================================================

typedef struct {
    u32              size;                           /* 0x0000 */
    Gfx             *buf;                            /* 0x0004 */
    Gfx             *p;                              /* 0x0008 */
    Gfx             *d;                              /* 0x000C */
} z2_disp_buf_t;                                     /* 0x0010 */

typedef struct {
    Gfx             *poly_opa_d_start;               /* 0x0000 */
    Gfx             *poly_xlu_d_start;               /* 0x0004 */
    u8               unk_0x08[0x08];                 /* 0x0008 */
    Gfx             *overlay_d_start;                /* 0x0010 */
    u8               unk_0x14[0x24];                 /* 0x0014 */
    OSMesg           task_mesg[8];                   /* 0x0038 */
    u8               unk_0x58[0x04];                 /* 0x0058 */
    OSMesgQueue      task_queue;                     /* 0x005C */
    u8               pad_0x74[0x04];                 /* 0x0074 */
    OSScTask         task;                           /* 0x0078 */
    u8               unk_0xD0[0xD0];                 /* 0x00D0 */
    Gfx             *work_d_start;                   /* 0x01A0 */
    z2_disp_buf_t    work;                           /* 0x01A4 */
    u8               unk_0x1B4[0x04];                /* 0x01B4 */
    z2_disp_buf_t    unk_0x1B8_buf;                  /* 0x01B8 */
    u8               unk_0x1C8[0xD0];                /* 0x01C8 */
    z2_disp_buf_t    overlay;                        /* 0x0298 */
    z2_disp_buf_t    poly_opa;                       /* 0x02A8 */
    z2_disp_buf_t    poly_xlu;                       /* 0x02B8 */
    u32              frame_cnt_1;                    /* 0x02C8 */
    void            *frame_buffer;                   /* 0x02CC */
    u8               unk_0x2D0[0x0B];                /* 0x02D0 */
    u8               frame_cnt_2;                    /* 0x02DB */
    void            *func_0x2DC;                     /* 0x02DC */
    z2_game_t       *game;                           /* 0x02E0 */
} z2_gfx_t;                                          /* 0x02E4 */

/// =============================================================
/// Context Structure
/// =============================================================

typedef struct z2_ctxt_s z2_ctxt_t;
typedef void (*z2_GameUpdate)(z2_ctxt_t *ctxt);

struct z2_ctxt_s {
    z2_gfx_t        *gfx;                            /* 0x0000 */
    z2_GameUpdate    gamestate_update;               /* 0x0004 */
    void            *gamestate_dtor;                 /* 0x0008 */
    void            *gamestate_ctor;                 /* 0x000C */
    u32              ctxt_size;                      /* 0x0010 */
    z2_input_t       input[4];                       /* 0x0014 */
    u32              gamestate_heap_size;            /* 0x0074 */
    void            *gamestate_heap_ptr;             /* 0x0078 */
    void            *heap_append_start;              /* 0x007C */
    void            *heap_append_end;                /* 0x0080 */
    void            *gamestate_heap_node;            /* 0x0084 */
    u8               unk_0x88[0x10];                 /* 0x0088 */
    s32              execute_state;                  /* 0x0098 */
    s32              gamestate_frames;               /* 0x009C */
    s32              unk_0xA0;                       /* 0x00A0 */
};                                                   /* 0x00A4 */

/// =============================================================
/// View & Camera
/// =============================================================

typedef struct {
    char             view_magic[4];                  /* 0x0000 */
    z2_gfx_t        *gfx;                            /* 0x0004 */
    struct {
        u32          top;                            /* 0x0008 */
        u32          bottom;                         /* 0x000C */
        u32          left;                           /* 0x0010 */
        u32          right;                          /* 0x0014 */
    } screen;
    f32              camera_distance;                /* 0x0018 */
    f32              fog_distance;                   /* 0x001C */
    f32              z_distance;                     /* 0x0020 */
    u8               unk_0x24[0x04];                 /* 0x0024 */
    z2_xyzf_t        unk_0x28;                       /* 0x0028 */
    z2_xyzf_t        unk_0x34;                       /* 0x0034 */
    z2_xyzf_t        unk_0x40;                       /* 0x0040 */
    u8               unk_0x4C[0x04];                 /* 0x004C */
    Vp               viewport_movemem;               /* 0x0050 */
    Mtx              unk_mtx_0x60;                   /* 0x0060 */
    Mtx              unk_mtx_0xA0;                   /* 0x00A0 */
    char             unk_0x00E0[0x40];               /* 0x00E0 */
    Mtx             *unk_mtx_0x60_task;              /* 0x0120 */
    Mtx             *unk_mtx_0xA0_task;              /* 0x0124 */
    f32              unk_0x128[0x09];                /* 0x0128 */
    char             unk_0x14C[0x10];                /* 0x014C */
    u16              perspnorm_scale;                /* 0x015C */
    u32              unk_0x160;                      /* 0x0160 */
    u32              unk_0x164;                      /* 0x0164 */
} z2_view_t;                                         /* 0x0168 */

typedef struct {
    union {
        struct {
            z2_xyzf_t  unk_0x00;                     /* 0x0000 */
            struct {
                f32  unk_1_0x00;
                f32  unk_1_0x04;
                s16  unk_1_0x08;
                s16  unk_1_0x0A;
                s16  unk_1_0x0C;
                f32  unk_1_0x10;
            };
        }            t1;
        struct {
            u16      unk_0x00;
        }            t2;
        u8           unk_0x00[0x50];
    };
    z2_xyzf_t        unk_0x50;                       /* 0x0050 */
    z2_xyzf_t        unk_0x5C;                       /* 0x005C */
    z2_xyzf_t        unk_0x68;                       /* 0x0068 */
    u8               unk_0x74[0x0C];                 /* 0x0074 */
    z2_xyzf_t        unk_0x80;                       /* 0x0080 */
    z2_ctxt_t       *game;                           /* 0x008C */
    z2_actor_t      *focus;                          /* 0x0090 */
    z2_xyzf_t        focus_pos;                      /* 0x0094 */
    u32              unk_0xA0;                       /* 0x00A0 */
    u32              unk_0xA4;                       /* 0x00A4 */
    u32              unk_0xA8;                       /* 0x00A8 */
    u8               unk_0xAC[0x94];                 /* 0x00AC */
    s16              unk_0x140;                      /* 0x0140 */
    s16              state;                          /* 0x0142 */
    s16              mode;                           /* 0x0144 */
    s16              unk_0x146;                      /* 0x0146 */
    s16              unk_0x148;                      /* 0x0148 */
    s16              unk_0x14A;                      /* 0x014A */
    s16              unk_flag_0x14C;                 /* 0x014C */
    u8               unk_0x14E[0x2A];                /* 0x014E */
} z2_camera_t;                                       /* 0x0178 */

/// =============================================================
/// Actor Context
/// =============================================================

/**
 * z2_actor_ctxt_t
 **/
typedef struct {
    /* game_t 0x1CA0 */
    u8               unk_0x00[0x04];                 /* 0x0000 */
    s8               unk_0x04;                       /* 0x0004 */
    u8               unk_0x05;                       /* 0x0005 */
    u8               unk_0x06[0x05];                 /* 0x0006 */
    s8               unk_0x0B;                       /* 0x000B */
    u8               unk_0x0C[0x02];                 /* 0x000C */
    u8               n_actors_loaded;                /* 0x000E */
    u8               unk_0x0F;                       /* 0x000F */
    struct {
        s32          count;                          /* 0x0000 */
        z2_actor_t  *first;                          /* 0x0004 */
        s32          unk;                            /* 0x0008 */
                                                     /* 0x000C */
    }                actor_list[0x10];               /* 0x0010 */
    u8               unk_0xD0[0x50];                 /* 0x00D0 */
    struct {
        MtxF         unk_0x120;                      /* 0x0120 */
        f32          unk_0x160;                      /* 0x0160 */
        f32          unk_0x164;                      /* 0x0164 */
        s16          unk_0x168;                      /* 0x0168 */
        u8           unk_0x16A;                      /* 0x016A */
        u8           unk_0x16B;                      /* 0x016B */
        s8           unk_0x16C;                      /* 0x016C */
        struct {
            f32      unk_0x00;                       /* 0x0000 */
            f32      unk_0x04;                       /* 0x0004 */
            f32      unk_0x08;                       /* 0x0008 */
            f32      unk_0x0C;                       /* 0x000C */
            s32      unk_0x10;                       /* 0x0010 */
                                                     /* 0x0014 */
        }            unk_0x170[0x03];                /* 0x0170 */
        s32          unk_0x1AC;                      /* 0x01AC */
        s32          unk_0x1B0;                      /* 0x01B0 */
        s32          unk_0x1B4;                      /* 0x01B4 */
    };
    s32              switch_1;                       /* 0x01B8, perm */
    s32              switch_2;                       /* 0x01BC, perm */
    s32              switch_3;                       /* 0x01C0 */
    s32              switch_4;                       /* 0x01C4 */
    s32              chest;                          /* 0x01C8 */
    s32              clear;                          /* 0x01CC */
    s32              unk_0x01D0;                     /* 0x01D0 */
    s32              collectible_1;                  /* 0x01D4, perm */
    s32              collectible_2;                  /* 0x01D8 */
    s32              collectible_3;                  /* 0x01DC */
    s32              collectible_4;                  /* 0x01E0 */
    struct {
        u8           unk_0x00[0x0A];                 /* 0x0000 */
        s8           unk_0x0A;                       /* 0x000A */
        s8           unk_0x0B;                       /* 0x000B */
        s16          unk_0x0C;                       /* 0x000C */
        s16          unk_0x0E;                       /* 0x000E */
                                                     /* 0x0010 */
    }                unk_0x1E4;                      /* 0x01E4 */
    s8               unk_0x1F4;                      /* 0x01F4 */
    u8               unk_0x1F5;                      /* 0x01F5 */
    f32              unk_0x1F8;                      /* 0x01F8 */
    u8               unk_0x1FC[0x54];                /* 0x01FC */
    s32              unk_0x250;                      /* 0x0250 */
    u8               unk_0x254[0x14];                /* 0x0254 */
    u8               unk_0x268;                      /* 0x0268 */
    u8               unk_0x269[0x03];                /* 0x0269 */
    u8               unk_0x26C[0x18];                /* 0x026C */
} z2_actor_ctxt_t;                                   /* 0x0284 */

/// =============================================================
/// Collision Context
/// =============================================================

typedef struct {
    s16              poly_idx;                       /* 0x0000 */
    u16              list_next;                      /* 0x0002 */
} z2_col_list_t;                                     /* 0x0004 */

typedef struct {
    struct {
        u32                      : 1;
        u32          drop        : 1;                /* Link drops one unit into the floor. */
        u32          special     : 4;
        u32          interaction : 5;
        u32                      : 3;
        u32          behavior    : 5;
        u32          exit        : 5;
        u32          camera      : 8;
    }                flags_1;                        /* 0x0000 */
    struct {
        u32          pad         : 4;
        u32          wall_damage : 1;
        u32                      : 6;
        u32                      : 3;
        u32          hookshot    : 1;
        u32          echo        : 6;
        u32                      : 5;
        u32          terrain     : 2;
        u32          material    : 4;
    }                flags_2;                        /* 0x0004 */
} z2_col_type_t;                                     /* 0x0008 */

typedef struct {
    z2_xyz_t         pos;                            /* 0x0000 */
    s16              width;                          /* 0x0006 */
    s16              depth;                          /* 0x0008 */
    struct {
        u32                 : 12;
        u32          active : 1;
        u32          group  : 6;
        u32                 : 5;
        u32          camera : 8;
    } flags;                                         /* 0x000A */
} z2_col_water_t;                                    /* 0x000E */

typedef struct {
    u16              type;                           /* 0x0000, index of z2_col_type in scene file */
    /* Vertex indices, a and b are bitmasked for some reason. */
    struct {
        u16          unk_0 : 3;
        u16          va    : 13;
    }                mask_1;                         /* 0x0002 */
    struct {
        u16          unk_1 : 3;
        u16          vb    : 13;
    }                mask_2;                         /* 0x0004 */
    u16              vc;                             /* 0x0006 */
    z2_xyz_t         norm;                           /* 0x0008, normal vector. */
    s16              dist;                           /* 0x000E, plane distance from origin. */
} z2_col_poly_t;                                     /* 0x0010 */

typedef struct {
    z2_xyz_t         min;                            /* 0x0000 */
    z2_xyz_t         max;                            /* 0x0006 */
    u16              n_vtx;                          /* 0x000C */
    z2_xyz_t        *vtx;                            /* 0x000E */
    u16              n_poly;                         /* 0x0012 */
    z2_col_poly_t   *poly;                           /* 0x0014 */
    z2_col_type_t   *type;                           /* 0x0018 */
    z2_camera_t     *camera;                         /* 0x001C */
    u16              n_water;                        /* 0x0020 */
    z2_col_water_t  *water;                          /* 0x0022 */
} z2_col_hdr_t;                                      /* 0x0026 */

typedef struct {
    z2_actor_t      *actor;                          /* 0x0000 */
    z2_col_hdr_t    *col_hdr;                        /* 0x0004 */
    u16              unk_0x08;                       /* 0x0008 */
    u16              unk_0x0A;                       /* 0x000A */
    u16              unk_0x0C;                       /* 0x000C */
    s16              unk_0x0E;                       /* 0x000E, number of polys? */
    s16              unk_0x10;                       /* 0x0010 */
    z2_xyzf_t        scale_1;                        /* 0x0014 */
    z2_rot_t         rot_1;                          /* 0x0020 */
    z2_xyzf_t        pos_1;                          /* 0x0028 */
    z2_xyzf_t        scale_2;                        /* 0x0034 */
    z2_rot_t         rot_2;                          /* 0x0040 */
    z2_xyzf_t        pos_2;                          /* 0x0048 */
    s16              unk_0x54;                       /* 0x0054 */
    s16              unk_0x56;                       /* 0x0056 */
    s16              unk_0x58;                       /* 0x0058 */
    s16              unk_0x5A;                       /* 0x005A */
    u8               unk_0x5C[0x08];                 /* 0x005C */
} z2_col_chk_actor_t;                                /* 0x0064 */

typedef struct {
    u16              floor_list_idx;                 /* 0x0000 */
    u16              wall_list_idx;                  /* 0x0002 */
    u16              ceil_list_idx;                  /* 0x0004 */
} z2_col_lut_t;                                      /* 0x0006 */

typedef struct {
    /* static collision stuff */
    z2_col_hdr_t    *col_hdr;                        /* 0x0000 */
    z2_xyzf_t        bbox_min;                       /* 0x0004 */
    z2_xyzf_t        bbox_max;                       /* 0x0010 */
    s32              n_sect_x;                       /* 0x001C */
    s32              n_sect_y;                       /* 0x0020 */
    s32              n_sect_z;                       /* 0x0024 */
    z2_xyzf_t        sect_size;                      /* 0x0028 */
    z2_xyzf_t        sect_inv;                       /* 0x0034 */
    z2_col_lut_t    *stc_lut;                        /* 0x0040 */
    u16              stc_list_max;                   /* 0x0044 */
    u16              stc_list_pos;                   /* 0x0046 */
    z2_col_list_t   *stc_list;                       /* 0x0048 */
    u8              *stc_check;                      /* 0x004C */

                                                     /* bg actor collision struct start */
    s8               unk_0x50[0x04];                 /* 0x0050, MIGHT BE [0x04]???? */
    z2_col_chk_actor_t actors[50];                   /* 0x0054 */
    u16              actor_loaded[50];               /* 0x13DC */
                                                     /* dynamic collision stuff */
    z2_col_poly_t   *dyn_poly;                       /* 0x1440 */
    z2_xyz_t        *dyn_vtx;                        /* 0x1444 */
    s32              unk_0x1448;                     /* 0x1448 */
    void            *unk_0x144C;                     /* 0x144C */
                                                     /* struct */
    struct {
        z2_col_list_t *list;                         /* 0x1450 */
        s32          count;                          /* 0x1454 */
        s32          max;                            /* 0x1458 */
    } dyn;
                                                     /* bg actor collision struct end */
    u32              dyn_list_max;                   /* 0x145C */
    u32              dyn_poly_max;                   /* 0x1460 */
    u32              dyn_vtx_max;                    /* 0x1464 */
    u32              mem_size;                       /* 0x1468 */
    u32              unk_0x146C;                     /* 0x146C */
} z2_col_ctxt_t;                                     /* 0x1470 */

/// =============================================================
/// HUD Context
/// =============================================================

typedef struct {
    u8               unk_0x00[0x170];                /* 0x0000 */
    void            *parameter_static;               /* 0x0170 */
    void            *do_action_static;               /* 0x0174 */
    void            *icon_item_static;               /* 0x0178 */
    void            *minimap_texture;                /* 0x017C */
    u8               unk_0x180[0x04];                /* 0x0180 */
    u32              action_rom_addr;                /* 0x0184 */
    void            *action_ram;                     /* 0x0188 */
    u32              action_size;                    /* 0x018C */
    u8               unk_0x190[0x80];                /* 0x0190 */
    s16              a_text_transition_timer;        /* 0x0210 */
    u16              a_text_current;                 /* 0x0212 */
    u16              a_text_transition;              /* 0x0214 */
    u8               unk_0x216[0x10];                /* 0x0216 */
    u16              heartbeat_timer;                /* 0x0226 */
    u16              heartbeat_mode;                 /* 0x0228 */
    z2_color_rgb16_t heartbeat_inner_rgb;            /* 0x022A */
    z2_color_rgb16_t heartbeat_outer_rgb;            /* 0x0230 */
    z2_color_rgb16_2_t heart_inner_rgb;              /* 0x0236 */
    z2_color_rgb16_2_t heart_outer_rgb;              /* 0x0242 */
    u8               unk_0x24E[0x16];                /* 0x024E */
    union {
        struct {
            u16      fadeout_alpha;                  /* 0x0264 */
            u16      a_alpha;                        /* 0x0266 */
            u16      b_alpha;                        /* 0x0268 */
            u16      c_left_alpha;                   /* 0x026A */
            u16      c_down_alpha;                   /* 0x026C */
            u16      c_right_alpha;                  /* 0x026E */
            u16      hearts_alpha;                   /* 0x0270 */
            u16      rupees_alpha;                   /* 0x0272, also magic meter alpha */
            u16      minimap_alpha;                  /* 0x0274 */
        };
        u16          alphas[0x09];                   /* 0x0264 */
    };
    u8               unk_0x276[0x98];                /* 0x0276 */
    u8               restriction_flags[0x0C];        /* 0x030E */
    u8               unk_0x31A[0x2E];                /* 0x031A */
} z2_hud_ctxt_t;                                     /* 0x0348 */

/// =============================================================
/// Pause Context
/// =============================================================

typedef union {
    struct {
        u16          item;
        u16          map;
        u16          quest;
        u16          mask;
    };
    u16              cells[0x04];                    /* 0x0000 */
} z2_pause_cells_t;                                  /* 0x0008 */

typedef struct {
    z2_view_t        view;                           /* 0x0000 */
    void            *icon_item_static;               /* 0x0168 */
    void            *icon_item_24;                   /* 0x016C */
    void            *icon_item_map;                  /* 0x0170 */
    void            *icon_text;                      /* 0x0174 */
    void            *unk_text_0x178;                 /* 0x0178 */
    Gfx             *bg_dlist;                       /* 0x017C */
    u8               unk_0x180[0x10];                /* 0x0180 */
    Vtx             *vtx_buf;                        /* 0x0190 */
    u8               unk_0x194[0x58];                /* 0x0194 */
    u16              state;                          /* 0x01EC */
    u16              debug_menu;                     /* 0x01EE */
    u8               unk_0x1F0[0x10];                /* 0x01F0 */
    u16              switching_screen;               /* 0x0200 */
    u16              unk_0x202;                      /* 0x0202 */
    u16              screen_idx;                     /* 0x0204 */
    u8               unk_0x206[0x1E];                /* 0x0206 */
    u16              item_alpha;                     /* 0x0224 */
    u8               unk_0x226[0x12];                /* 0x0226 */
    z2_pause_cells_t cells_1;                        /* 0x0238 */
    u8               unk_0x240[0x02];                /* 0x0240 */
    u16              item_x;                         /* 0x0242 */
    u8               unk_0x244[0x04];                /* 0x0244 */
    u16              mask_x;                         /* 0x0248 */
    u8               unk_0x24A[0x02];                /* 0x024A */
    u16              item_y;                         /* 0x024C */
    u8               unk_0x24E[0x04];                /* 0x024E */
    u16              mask_y;                         /* 0x0252 */
    u8               unk_0x254[0x04];                /* 0x0254 */
    s16              side_button;                    /* 0x0258 */
    u8               unk_0x25A[0x02];                /* 0x025A */
    u16              selected_item;                  /* 0x025C */
    u16              item_item;                      /* 0x025E */
    u16              map_item;                       /* 0x0260 */
    u16              quest_item;                     /* 0x0262 */
    u16              mask_item;                      /* 0x0264 */
    u16              unk_0x266;                      /* 0x0266 */
    z2_pause_cells_t cells_2;                        /* 0x0268 */
} z2_pause_ctxt_t;                                   /* 0x0270 */

/// =============================================================
/// Object Context
/// =============================================================

typedef struct {
    u32              vrom_addr;                      /* 0x0000 */
    void            *dram;                           /* 0x0004 */
    u32              size;                           /* 0x0008 */
} z2_loadfile_t;                                     /* 0x000C */

typedef struct {
    /* file loading params */
    z2_loadfile_t    common;                         /* 0x0000 */
    /* debug stuff */
    char            *filename;                       /* 0x000C */
    s32              line;                           /* 0x0010 */
    s32              unk_0x14;                       /* 0x0014 */
    /* completion notification params */
    OSMesgQueue     *notify_mq;                      /* 0x0018 */
    OSMesg           notify_msg;                     /* 0x001C */
} z2_getfile_t;                                      /* 0x0020 */

typedef struct {
    s16              id;                             /* 0x0000 */
    u8               pad_0x02[0x02];                 /* 0x0002 */
    void            *data;                           /* 0x0004 */
    z2_getfile_t     loadfile;                       /* 0x0008 */
    OSMesgQueue      load_mq;                        /* 0x0028 */
    OSMesg           load_msg;                       /* 0x0040 */
} z2_obj_t;                                          /* 0x0044 */

typedef struct {
    void            *obj_space_start;                /* 0x0000 */
    void            *obj_space_end;                  /* 0x0004 */
    u8               obj_cnt;                        /* 0x0008 */
    u8               spec_cnt;                       /* 0x0009 */
    u8               keep_idx;                       /* 0x000A */
    u8               skeep_idx;                      /* 0x000B, maybe? keep & skeep both 0 */
    z2_obj_t         obj[35];                        /* 0x000C */
} z2_obj_ctxt_t;                                     /* 0x0958 */

/// =============================================================
/// Room Context
/// =============================================================

typedef struct {
    u8               idx;                            /* 0x0000 */
    u8               unk_0x01[0x03];                 /* 0x0001 */
    u8               echo;                           /* 0x0004 */
    u8               show_invisible_actor;           /* 0x0005 */
    u8               pad_0x06[0x02];                 /* 0x0006 */
    void            *mesh_hdr;                       /* 0x0008 */
    void            *file;                           /* 0x000C */
    u8               unk_0x10[0x04];                 /* 0x0010 */
} z2_room_t;                                         /* 0x0014 */

typedef struct {
    z2_room_t        rooms[2];                       /* 0x0000 */
    void            *room_space_start;               /* 0x0028 */
    void            *room_space_end;                 /* 0x002C */
    u8               load_slot;                      /* 0x0030 */
    u8               load_active;                    /* 0x0031 */
    u8               pad_0x32[0x02];                 /* 0x0032 */
    void            *load_addr;                      /* 0x0034 */
    z2_getfile_t     loadfile;                       /* 0x0038 */
    OSMesgQueue      load_mq;                        /* 0x0058 */
    OSMesg           load_msg;                       /* 0x0070 */
    u8               unk_0x0074[0x04];               /* 0x0074 */
    u8               transition_cnt;                 /* 0x0078 */
    u8               pad_0x79[0x03];                 /* 0x0079 */
    void            *transition_list;                /* 0x007C */
} z2_room_ctxt_t;                                    /* 0x0080 */

/// =============================================================
/// Ocarina & Song
/// =============================================================

enum z2_stored_song {
    // No stored song while using ocarina.
    Z2_STORED_SONG_OCARINA_NONE = 0xFE,
    // No stored song (while not using ocarina).
    Z2_STORED_SONG_NONE = 0xFF,
};

typedef struct {
    /* Might be part of a larger messagebox context. */
    s8               notes[0x09];                    /* 0x0000, 8 notes + extra terminator (0xFF). */
    u8               pad[0x03];                      /* 0x0009 */
    s16              alphas[0x08];                   /* 0x000C, note alphas. */
} z2_song_notes_t;                                   /* 0x001C */

/**
 * Structure with some song state.
 *
 * Usually located at: 0x801FD43A
 **/
typedef struct {
    s8               recent_note;                    /* 0x0000 */
    s8               stored_song;                    /* 0x0001 */
    s8               note_index;                     /* 0x0002 */
    u8               unk_0x03;                       /* 0x0003 */
    s8               playback_recent_note;           /* 0x0004 */
    u8               playback_state;                 /* 0x0005 */
                                                     /* 1 while doing playback, is reset to 0 to show the "You Played X song" text. */
    u8               playback_note_index;            /* 0x0006 */
    u8               unk_0x07[0x03];                 /* 0x0007 */
    s8               note_index_2;                   /* 0x000A */
    u8               unk_0x0B[0x05];                 /* 0x000B */
    u16              frame_count;                    /* 0x0010 */
    z2_angle_t       analog_angle;                   /* 0x0012, angle of analog stick, modifies sound. */
    u16              unk_0x14;                       /* 0x0014 */
    u32              controller_0x16;                /* 0x0016 */
    u32              unk_0x1A;                       /* 0x001A */
    u32              controller_0x1E;                /* 0x001E */
    u32              controller_0x22;                /* 0x0022 */
    u16              unk_0x26;                       /* 0x0026 */
    u8               has_played_note;                /* 0x0028, 1 if has played note since using ocarina. */
    u8               unk_0x29[0x07];                 /* 0x0029 */
    u16              flags;                          /* 0x0030, is 0x37DF if all songs. */
    u8               note_index_3;                   /* 0x0032 */
    u8               pad_0x33;                       /* 0x0033 */
} z2_song_ctxt_t;                                    /* 0x0034 */

/// =============================================================
/// Static Context
/// =============================================================

typedef struct {
    u8               unk_0x00[0x32];                 /* 0x0000 */
    s16              time_speed;                     /* 0x0032 */
    u8               unk_0x34[0x06];                 /* 0x0034 */
    s16              acceleration;                   /* 0x003A */
    u8               unk_0x3C[0x0E];                 /* 0x003C */
    s16              turn_speed;                     /* 0x004A */
    u8               unk_0x4E[0x50];                 /* 0x004C */
    s16              gravity;                        /* 0x009C */
    u8               unk_0x9E[0x72];                 /* 0x009E */
    u16              update_rate;                    /* 0x0110 */
} z2_static_ctxt_t;                                  /* 0x0112 */

/// =============================================================
/// Game Structure
/// =============================================================

struct z2_game_s {
    z2_ctxt_t        common;                         /* 0x00000 */
    u16              scene_index;                    /* 0x000A4 */
    u8               scene_draw_id;                  /* 0x000A6 */
    u8               unk_0x000A7[0x09];              /* 0x000A7 */
    void            *scene_addr;                     /* 0x000B0 */
    u8               unk_0x00B4[0x04];               /* 0x000B4 */
    z2_view_t        view_scene;                     /* 0x000B8 */
    z2_camera_t      cameras[4];                     /* 0x00220 */
    z2_camera_t     *active_cameras[4];              /* 0x00800 */
    s16              camera_cur;                     /* 0x00810 */
    s16              camera_next;                    /* 0x00812 */
    u8               unk_0x814[0x1C];                /* 0x00814 */
    z2_col_ctxt_t    col_ctxt;                       /* 0x00830 */
    z2_actor_ctxt_t  actor_ctxt;                     /* 0x01CA0 */
    u8               unk_0x1F24[0x04];               /* 0x01F24 */
    void            *cutscene_ptr;                   /* 0x01F28 */
    s8               cutscene_state;                 /* 0x01F2C */
    u8               unk_0x1F2D[0x148DB];            /* 0x01F2D */
    z2_song_ctxt_t  *song_ctxt;                      /* 0x16808 */
    u8               unk_0x1680C[0x0C];              /* 0x1680C */
    u32              unk_0x16818;                    /* 0x16818 */
    u8               unk_0x1681C[0x0E];              /* 0x1681C */
    u8               message_state_1;                /* 0x1682A */
    u8               unk_0x1682B[0xFD];              /* 0x1682B */
    u8               message_state_2;                /* 0x16928 */
    u8               unk_0x16829[0x02];              /* 0x16929 */
    u8               message_state_3;                /* 0x1692B */
    u8               unk_0x1692C[0x9C];              /* 0x1692C */
    u8               unk_0x169C8[0x20];              /* 0x169C8 */
    z2_hud_ctxt_t    hud_ctxt;                       /* 0x169E8 */
    z2_pause_ctxt_t  pause_ctxt;                     /* 0x16D30 */
    u8               unk_0x16F30[0xDE8];             /* 0x16FA0 */
    z2_obj_ctxt_t    obj_ctxt;                       /* 0x17D88 */
    z2_room_ctxt_t   room_ctxt;                      /* 0x186E0 */
    u8               room_cnt;                       /* 0x18760 */
    u8               unk_0x18761[0x114];             /* 0x18761 */
    u8               scene_load_flag;                /* 0x18875 */
    u8               unk_0x18876[0x04];              /* 0x18876 */
    u16              entrance_index;                 /* 0x1887A, double check this offset. */
    u8               unk_0x1887C[0x2CE];             /* 0x1887C */
    u8               flag_0x18B4A;                   /* 0x18B4A */
};                                                   /* 0x18B4B */

/// =============================================================
/// Savefile Structure
/// =============================================================

typedef struct {
    u16              transition_state;               /* 0x0000 */
    u16              state;                          /* 0x0002 */
    u16              alpha_transition;               /* 0x0004 */
    u16              previous_state;                 /* 0x0006 */
} z2_buttons_state_t;                                /* 0x0008 */

/**
 * Scene flags, stored in z2_file_t.
 */
typedef struct {
    u32              chest;                          /* 0x0000 */
    u32              switch1;                        /* 0x0004 */
    u32              switch2;                        /* 0x0008 */
    u32              clear;                          /* 0x000C */
    u32              collectible;                    /* 0x0010 */
} z2_scene_flags_t;                                  /* 0x0014 */

/**
 * Save scene flags, stored in z2_file_t.
 **/
typedef struct {
    u32              chest;                          /* 0x0000 */
    u32              switch1;                        /* 0x0004 */
    u32              switch2;                        /* 0x0008 */
    u32              clear;                          /* 0x000C */
    u32              collectible;                    /* 0x0010 */
    u32              unk_0x14;                       /* 0x0014 */
    u32              unk_0x18;                       /* 0x0018 */
} z2_save_scene_flags_t;                             /* 0x001C */

/**
 * Savefile structure.
 **/
typedef struct {
    union {
        struct {
            u32                 : 16;
            u32      scene      : 7;
            u32      entrance   : 5;
            u32      offset     : 4;
        };
        u32          exit;                           /* 0x0000 */
    };
    u8               mask;                           /* 0x0004 */
    u8               intro_flag;                     /* 0x0005 */
    u8               mash_timer;                     /* 0x0006 */
    u8               unk_0x07;                       /* 0x0007 */
    u32              cutscene_id;                    /* 0x0008 */
    u16              time_of_day;                    /* 0x000C */
    u16              owl_load;                       /* 0x000E */
    u32              daynight;                       /* 0x0010 */
    s32              timespeed;                      /* 0x0014 */
    u32              day;                            /* 0x0018 */
    u32              elapsed_days;                   /* 0x001C */
    u8               current_form;                   /* 0x0020 */
    u8               unk_0x21;                       /* 0x0021 */
    u8               tatl_flag;                      /* 0x0022 */
    u8               owl_save;                       /* 0x0023 */
    char             zelda3[0x06];                   /* 0x0024 */
    u16              sot_count;                      /* 0x002A */
    u8               name[0x08];                     /* 0x002C */
    u16              max_health;                     /* 0x0034 */
    u16              current_health;                 /* 0x0036 */
    u8               magic_level;                    /* 0x0038 */
    u8               current_magic;                  /* 0x0039 */
    u16              rupees;                         /* 0x003A */
    u32              tatl_timer;                     /* 0x003C */
    u8               has_magic;                      /* 0x0040 */
    u8               has_double_magic;               /* 0x0041 */
    u8               has_double_defense;             /* 0x0042 */
    u8               unk_0x43[0x03];                 /* 0x0043 */
    union {
        struct {
            u16      hidden_owl         : 1;
            u16                         : 4;
            u16      dungeon_entrance   : 1;
            u16      stone_tower        : 1;
            u16      ikana_canyon       : 1;
            u16      southern_swap      : 1;
            u16      woodfall           : 1;
            u16      milk_road          : 1;
            u16      clock_town         : 1;
            u16      mountain_village   : 1;
            u16      snowhead           : 1;
            u16      zora_cape          : 1;
            u16      great_bay          : 1;
        };
        u16          owls_hit;                       /* 0x0046 */
    };
    char             unk_0x48[0x04];                 /* 0x0048 */
    union {
        struct {
            s8       b;
            s8       cleft;
            s8       cdown;
            s8       cright;
        };
        s8           button_item[0x04];
    }                form_button_item[0x04];         /* 0x004C */
    union {
        struct {
            s8       b;
            s8       cleft;
            s8       cdown;
            s8       cright;
        };
        s8           button_slot[0x04];
    }                form_button_slot[0x04];         /* 0x005C */
    union {
        struct {
            u16             : 10;
            u16      shield : 2;
            u16             : 2;
            u16      sword  : 2;
        };
        u16          equipment;                      /* 0x006C */
    };
    char             unk_0x6E[0x02];                 /* 0x006E */
    union {
        u8           inventory[0x30];                /* 0x0070 */
        struct {
            u8       items[0x18];                    /* 0x0070 */
            u8       masks[0x18];                    /* 0x0088 */
        };
    };
    u8               ammo[0x18];                     /* 0x00A0 */
    union {
        struct {
            u32                             : 9;     /* & 0xFF800000 >> 0x17 */
            u32      nut_upgrade            : 3;     /* & 0x00700000 >> 0x14 */
            u32      stick_upgade           : 3;     /* & 0x000E0000 >> 0x11 */
            u32                             : 3;     /* & 0x00018000 >> 0x0F */
            u32      wallet_upgrade         : 2;     /* & 0x00007000 >> 0x0C */
            u32                             : 6;     /* & 0x00000FC0 >> 0x06 */
            u32      bomb_bag               : 3;     /* & 0x00000038 >> 0x03 */
            u32      quiver                 : 3;     /* & 0x00000007 >> 0x00 */
        };
        u32          equipment_upgrades;             /* 0x00B8 */
    };
    union {
        struct {
            u32      heart_piece            : 4;
            u32                             : 3;
            u32      lullaby_intro          : 1;
            u32                             : 5;
            u32      bombers_notebook       : 1;
            u32      suns_song              : 1;
            u32      song_of_storms         : 1;
            u32      song_of_soaring        : 1;
            u32      eponas_song            : 1;
            u32      song_of_healing        : 1;
            u32      song_of_time           : 1;
            u32      sarias_song            : 1;
            u32      oath_to_order          : 1;
            u32      elegy_of_emptiness     : 1;
            u32      new_wave_bossa_nova    : 1;
            u32      goron_lullaby          : 1;
            u32      sonata_of_awakening    : 1;
            u32                             : 2;
            u32      twinmolds_remains      : 1;
            u32      gyorgs_remains         : 1;
            u32      gohts_remains          : 1;
            u32      odolwas_remains        : 1;
        };
        u32          quest_status;                   /* 0x00BC */
    };
    union {
        struct {
            u8                               : 5;
            u8       map                     : 1;
            u8       compass                 : 1;
            u8       boss_key                : 1;
        };
        u8           dungeon_item;
    }                dungeon_items[0xA];             /* 0x00C0 */
    u8               dungeon_keys[0x9];              /* 0x00CA */
    u8               defense_hearts;                 /* 0x00D3 */
    u8               stray_fairies[0xA];             /* 0x00D4 */
    char             form_name[0x8][0x3];            /* 0x00DE */
    u8               unk_0xF6[0x2];                  /* 0x00F6 */
    z2_save_scene_flags_t save_scene_flags[0x78];    /* 0x00F8 */
    u8               unk_0xE18[0xC6];                /* 0x0E18 */
    u16              bank_rupees;                    /* 0x0EDE */
    u8               unk_0xEE0[0x10];                /* 0x0EE0 */
    u32              lottery_guess;                  /* 0x0EF0 */
    u8               unk_0xEF4[0x04];                /* 0x0EF4 */
    union {
        struct {
            u8       unk_0x00[0x0E];                 /* 0x0EF8 */
            union {
                struct {
                    u8                : 4;
                    u8 infinite_magic : 1;
                    u8                : 3;
                };
                u8   flag_0x0E;                      /* 0x0F06 */
            };
            u8       unk_0x0F[0x08];                 /* 0x0F07 */
            u8       great_spin;                     /* 0x0F0F */
            u8       unk_0x18[0x4C];                 /* 0x0F10 */
        };
        u8           week_event_inf_bytes[0x64];     /* 0x0EF8 */
    }                week_event_inf;
    u32              locations_visited;              /* 0x0F5C */
    u8               unk_0xF60[0x7C];                /* 0x0F60 */
    u8               lotteries[0x09];                /* 0x0FDC */
    u8               unk_0xFE5[0x06];                /* 0x0FE5 */
    u8               bomber_code[0x05];              /* 0x0FEB */
    u8               unk_0xFF0[0x1C];                /* 0x0FF0 */
    u8               event_inf[0x08];                /* 0x100C */
    u8               unk_0x1014[0x02];               /* 0x1014 */
    u16              jinx_timer;                     /* 0x1016 */
    s16              rupee_timer;                    /* 0x1018 */
    u8               unk_0x101A[0x2C86];             /* 0x101A */
    s32              file_index;                     /* 0x3CA0 */
    u8               unk_0x3CA4[0x0C];               /* 0x3CA4 */
    s32              void_flag;                      /* 0x3CB0 */
    u8               unk_0x3CB4[0x11C];              /* 0x3CB4 */
    u8               timers[0x40];                   /* 0x3DD0 */
    u8               unk_0x3E10[0x108];              /* 0x3E10 */
    u8               buttons_usable[0x05];           /* 0x3F18, B, C-left, C-down, C-right, A buttons. */
    u8               unk_0x3F1D[0x03];               /* 0x3F1D */
    z2_buttons_state_t buttons_state;                /* 0x3F20 */
    u8               unk_0x3F28[0x06];               /* 0x3F28 */
    u16              magic_meter_size;               /* 0x3F2E */
    u8               unk_0x3F30[0x38];               /* 0x3F30 */
    z2_scene_flags_t scene_flags[0x78];              /* 0x3F68 */
    u8               unk_0x48C8[0x1010];             /* 0x48C8 */
    z2_color_rgb16_t heart_dd_beating_rgb;           /* 0x58D8 */
    u8               unk_0x58DE[0x12];               /* 0x58DE */
    z2_color_rgb16_t heart_dd_rgb;                   /* 0x58F0 */
} z2_file_t;                                         /* 0x58F6 */

/// =============================================================
/// Actor Structures
/// =============================================================

typedef struct {
    struct {
        u8           damage : 4;
        u8           effect : 4;
    }                attack[0x20];
} z2_actor_damage_table_t;

/* Actor callback prototypes */
typedef void (*z2_ActorMain_proc)(z2_actor_t *actor, z2_game_t *game);
typedef void (*z2_ActorDraw_proc)(z2_actor_t *actor, z2_game_t *game);

/**
 * Actor.
 **/
struct z2_actor_s {
    s16              id;                             /* 0x0000 */
    u8               type;                           /* 0x0002 */
    s8               room;                           /* 0x0003 */
    u32              flags;                          /* 0x0004 */
    z2_xyzf_t        pos_1;                          /* 0x0008 */
    z2_rot_t         rot_init;                       /* 0x0014 */
    u8               unk_0x1A[0x02];                 /* 0x001A */
    u16              variable;                       /* 0x001C */
    u8               alloc_index;                    /* 0x001E */
    u8               unk_0x1F;                       /* 0x001F */
    u16              sound_effect;                   /* 0x0020 */
    char             unk_0x22[0x02];                 /* 0x0022 */
    z2_xyzf_t        pos_2;                          /* 0x0024 */
    z2_rot_t         rot_dir;                        /* 0x0030 */
    u8               unk_0x36[0x02];                 /* 0x0036 */
    s8               unk_0x38;                       /* 0x0038 */
    u8               unk_0x39;                       /* 0x0039 */
    char             unk_0x3A[0x02];                 /* 0x003A, padding? */
    z2_xyzf_t        pos_3;                          /* 0x003C */
    z2_rot_t         rot_1;                          /* 0x0048 */
    u8               unk_0x4E[0x02];                 /* 0x004E */
    u32              unk_0x50;                       /* 0x0050 */
    f32              unk_0x54;                       /* 0x0054 */
    z2_xyzf_t        scale;                          /* 0x0058 */
    z2_xyzf_t        vel_1;                          /* 0x0064 */
    f32              xz_speed;                       /* 0x0070 */
    f32              gravity;                        /* 0x0074 */
    f32              min_vel_y;                      /* 0x0078 */

                                                     /* struct bgcheck common */
    z2_col_poly_t   *wall_poly;                      /* 0x007C */
    z2_col_poly_t   *floor_poly;                     /* 0x0080 */
    u8               wall_poly_source;               /* 0x0084 */
    u8               floor_poly_source;              /* 0x0085 */
    s16              wall_rot;                       /* 0x0086 */
    f32              floor_height;                   /* 0x0088, maybe? */
    f32              water_surface_dist;             /* 0x008C */
    u16              bgcheck_flags;                  /* 0x0090 */
    s16              unk_0x92_rot;                   /* 0x0092 */
    f32              unk_0x94;                       /* 0x0094 */
    f32              dist_from_link_xz;              /* 0x0098 */
    f32              dist_from_link_y;               /* 0x009C */

                                                     /* struct collision_check common */
    z2_actor_damage_table_t *damage_table;           /* 0x00A0 */
    z2_xyzf_t        vel_2;                          /* 0x00A4 */
    u8               unk_0xB0[0x06];                 /* 0x00B0 */
    u8               mass;                           /* 0x00B6 */
    u8               health;                         /* 0x00B7 */
    u8               damage;                         /* 0x00B8 */
    u8               damage_effect;                  /* 0x00B9 */
    u8               impact_effect;                  /* 0x00BA */
    u8               unk_0xBB;                       /* 0x00BB */

                                                     /* struct start */
    z2_rot_t         rot_2;                          /* 0x00BC */
    char             unk_0xC2[0x2];                  /* 0x00C2 */
    f32              unk_0xC4;                       /* 0x00C4 */
    void            *draw_drop_shadow;               /* 0x00C8 */
    f32              unk_0xCC;                       /* 0x00CC */
    u8               unk_0xD0;                       /* 0x00D0 */
    u8               pad_0xD1[0x3];                  /* 0x00D1 */
                                                     /* struct end */

    z2_xyzf_t        unk_0xD4;                       /* 0x00D4 */
    z2_xyzf_t        unk_0xE0;                       /* 0x00E0 */
    z2_xyzf_t        unk_0xEC;                       /* 0x00EC */
    f32              unk_0xF8;                       /* 0x00F8 */
    f32              unk_0xFC;                       /* 0x00FC */
    f32              unk_0x100;                      /* 0x0100 */
    f32              unk_0x104;                      /* 0x0104 */
    z2_xyzf_t        pos_4;                          /* 0x0108 */
    u16              unk_0x114;                      /* 0x0114 */
    u16              text_id;                        /* 0x0116 */
    s16              frozen;                         /* 0x0118 */
    u8               unk_0x11A[0x03];                /* 0x011A */
    u8               active;                         /* 0x011D */
    u8               unk_0x11E;                      /* 0x011E */
    u8               tatl_enemy_text_id;             /* 0x011F */
    z2_actor_t      *attached_a;                     /* 0x0120 */
    z2_actor_t      *attached_b;                     /* 0x0124 */
    z2_actor_t      *prev;                           /* 0x0128 */
    z2_actor_t      *next;                           /* 0x012C */
    void            *ctor;                           /* 0x0130 */
    void            *dtor;                           /* 0x0134 */
    z2_ActorMain_proc main_proc;                     /* 0x0138 */
    z2_ActorDraw_proc draw_proc;                     /* 0x013C */
    void            *code_entry;                     /* 0x0140 */
};                                                   /* 0x0144 */

/// =============================================================
/// Link Actor
/// =============================================================

/**
 * Macro for getting the z2_link_t pointer from the z2_game_t pointer.
 **/
#define Z2_LINK(GAME) ((z2_link_t*)((GAME->actor_ctxt.actor_list[2].first)))

/**
 * Link actor.
 **/
typedef struct {
    z2_actor_t       common;                         /* 0x0000 */
    u8               unk_0x144[0x02];                /* 0x0144 */
    u8               pre_use;                        /* 0x0146 */
    u8               unk_0x147[0x03];                /* 0x0147 */
    u8               item_out;                       /* 0x014A, which item Link currently has out? */
                                                     /* 0x14 = Ocarina, 0x15 = Bottle, 0x9 = Bow, 0xD = Hookshot */
    u8               form;                           /* 0x014B */
    u8               unk_0x14C[0x07];                /* 0x014C */
    u8               mask;                           /* 0x0153 */
    u8               mask_c;                         /* 0x0154, C button index (starting at 1) of current/recently worn mask */
    u8               previous_mask;                  /* 0x0155 */
    u8               unk_0x156[0x916];               /* 0x0156 */
    union {
        struct {
            u32      action_state1;                  /* 0x0A6C */
            u32      action_state2;                  /* 0x0A70 */
            u32      action_state3;                  /* 0x0A74 */
        };
        u32          state_flags[3];                 /* 0x0A6C */
    };
    u8               unk_0xA78[0x58];                /* 0x0A78 */
    f32              linear_velocity;                /* 0x0AD0 */
    u16              movement_angle;                 /* 0x0AD4 */
    u8               unk_0xAD6[0x05];                /* 0x0AD6 */
    u8               sword_active;                   /* 0x0ADB */
    u8               unk_0xADC[0x0B];                /* 0x0ADC */
    u8               anim_timer;                     /* 0x0AE7, some animation timer? Relevant to: transformation masks, freezing, etc */
    u16              frozen_timer;                   /* 0x0AE8 */
    u8               unk_0xAEA[0x76];                /* 0x0AEA */
    u16              blast_mask_timer;               /* 0x0B60 */
    u8               unk_0xB62[0x10];                /* 0x0B62 */
    u16              floor_type;                     /* 0x0B72, determines sound effect used while walking */
} z2_link_t;

/// =============================================================
/// Other Actors
/// =============================================================

/**
 * En_Elf actor.
 **/
typedef struct {
    z2_actor_t       common;                         /* 0x0000 */
    u8               unk_0x144[0x116];               /* 0x0144 */
    u16              anim_timer;                     /* 0x025A, counts from 0 to 0x5F as "fairy heal" animation progresses. */
} z2_fairy_actor_t;                                  /* 0x025C */

/**
 * En_Test4 actor.
 **/
typedef struct {
    z2_actor_t       common;                         /* 0x0000 */
    u8               daynight;                       /* 0x0144 */
    u8               unk_0x145;                      /* 0x0145 */
    u16              timer_boundaries[0x03];         /* 0x0146 */
} z2_timer_actor_t;                                  /* 0x014C */

/// =============================================================
/// Arenas
/// =============================================================

typedef struct z2_arena_node    z2_arena_node_t;
typedef struct z2_arena         z2_arena_t;

struct z2_arena_node {
    u16              magic;                          /* 0x0000 */
    u16              free;                           /* 0x0002 */
    u32              size;                           /* 0x0004 */
    z2_arena_node_t *next;                           /* 0x0008 */
    z2_arena_node_t *prev;                           /* 0x000C */
};                                                   /* 0x0010 */

struct z2_arena {
    z2_arena_node_t *first;                          /* 0x0000 */
    void            *start;                          /* 0x0004 */
    void            *unk_0x08;                       /* 0x0008 */
    void            *unk_0x0C;                       /* 00000C */
};                                                   /* 0x0010 */

/// =============================================================
/// Overlays & Tables
/// =============================================================

typedef struct {
    u32              vrom_start;                     /* 0x0000 */
    u32              vrom_end;                       /* 0x0004 */
    u32              vram_start;                     /* 0x0008 */
    u32              vram_end;                       /* 0x000C */
    void            *ram;                            /* 0x0010 */
    u32              initialization;                 /* 0x0014 */
    void            *filename;                       /* 0x0018 */
    u16              alloc_type;                     /* 0x001C */
    u8               loaded_cnt;                     /* 0x001E */
    u8               pad_0x1F;                       /* 0x001F */
} z2_actor_ovl_table_t;                              /* 0x0020 */

typedef struct {
    u32              vrom_start;                     /* 0x0000 */
    u32              vrom_end;                       /* 0x0004 */
    u32              prom_start;                     /* 0x0008 */
    u32              prom_end;                       /* 0x000C */
} z2_file_table_t;                                   /* 0x0010 */

typedef struct {
    void            *ram;                            /* 0x0000 */
    u32              vrom_start;                     /* 0x0004 */
    u32              vrom_end;                       /* 0x0008 */
    u32              vram_start;                     /* 0x000C */
    u32              vram_end;                       /* 0x0010 */
    u8               unk_0x14[0x04];                 /* 0x0014 */
    void            *vram_ctor;                      /* 0x0018 */
    void            *vram_dtor;                      /* 0x001C */
    u8               unk_0x20[0xC];                  /* 0x0020 */
    u32              alloc_size;                     /* 0x002C */
} z2_gamestate_table_t;                              /* 0x0030 */

typedef struct {
    union {
        z2_gamestate_table_t     states[7];          /* 0x0000 */
        struct {
            z2_gamestate_table_t reset;              /* 0x0000 */
            z2_gamestate_table_t map_select;         /* 0x0030 */
            z2_gamestate_table_t n64_logo;           /* 0x0060 */
            z2_gamestate_table_t gameplay;           /* 0x0090 */
            z2_gamestate_table_t title_screen;       /* 0x00C0 */
            z2_gamestate_table_t file_select;        /* 0x00F0 */
            z2_gamestate_table_t new_day;            /* 0x0120 */
        };
    };
} z2_gamestate_t;                                    /* 0x0150 */

typedef struct {
    u32              vrom_start;                     /* 0x0000 */
    u32              vrom_end;                       /* 0x0004 */
} z2_obj_file_t;                                     /* 0x0008 */

typedef struct {
    void            *ram;                            /* 0x0000 */
    u32              vrom_start;                     /* 0x0004 */
    u32              vrom_end;                       /* 0x0008 */
    u32              vram_start;                     /* 0x000C */
    u32              vram_end;                       /* 0x0010 */
    u8               unk_0x14[0x04];                 /* 0x0014 */
    char            *filename;                       /* 0x0018 */
} z2_player_ovl_table_t;                             /* 0x001C */

/// =============================================================
/// File Select Context
/// =============================================================

typedef struct {
    u8               unk_0x00[0x8D4];                /* 0x0000 */
    u16              rupee_colors[0x09];             /* 0x08D4 */
    u8               unk_0x8E6[0x16];                /* 0x08E6 */
    z2_color_rgb16_t heart_rgb[0x02];                /* 0x08FC */
    z2_color_rgb16_t heart_under_rgb[0x02];          /* 0x0908 */
    u8               unk_0x914[0x7AC];               /* 0x0914 */
} z2_file_select_ctxt_t;                             /* 0x10C0 */

/// =============================================================
/// Misc & Unknown
/// =============================================================

typedef struct {
    u32              direct_reference;               /* 0x0000 */
    u32              nintendo_logo;                  /* 0x0004 */
    u32              current_scene;                  /* 0x0008 */
    u32              current_room;                   /* 0x000C */
    u32              gameplay_keep;                  /* 0x0010 */
    u32              gameplay_dungeon_field_keep;    /* 0x0014 */
    u32              current_object;                 /* 0x0018 */
    u32              link_animation;                 /* 0x001C */
    u32              unk_0x20;                       /* 0x0020 */
    u32              unk_0x24;                       /* 0x0024 */
    u32              current_mask;                   /* 0x0028 */
    u32              unk_0x2C;                       /* 0x002C */
    u32              unk_0x30;                       /* 0x0030 */
    u32              unk_0x34;                       /* 0x0034 */
    u32              z_buffer;                       /* 0x0038 */
    u32              frame_buffer;                   /* 0x003C */
} z2_segment_t;                                      /* 0x0040 */

typedef struct {
    union {
        u16          digits[8];                      /* 0x0000 */
        struct {
            u16      minutes[2];                     /* 0x0000 */
            u16      sep1;                           /* 0x0004 */
            u16      seconds[2];                     /* 0x0006 */
            u16      sep2;                           /* 0x000A */
            u16      milliseconds[2];                /* 0x000C */
        };
    };
    u16              beep_seconds;                   /* 0x0010, previous seconds[1] value that had a beep. */
                                                     /* Likely used to determine when to do the next beep. */
} z2_timer_digits_t;                                 /* 0x0012 */

typedef struct {
    s16              unk_0x00;                       /* 0x0000 */
    s16              unk_0x02;                       /* 0x0002 */
    s16              unk_0x04;                       /* 0x0004 */
    s16              unk_0x06;                       /* 0x0006 */
    u32              unk_0x08;                       /* 0x0008 */
    u32              unk_0x0C;                       /* 0x000C */
    z2_game_t       *game;                           /* 0x0010 */
    s16              unk_0x14;                       /* 0x0014 */
    s16              unk_0x16;                       /* 0x0016 */
} z2_0x801BD8B0_t;                                   /* 0x0018 */

typedef struct {
    z2_player_ovl_table_t    pause_ovl;              /* 0x0000, VRAM: [0x808160A0, 0x8082DA90) */
    z2_player_ovl_table_t    player_ovl;             /* 0x001C, VRAM: [0x8082DA90, 0x80862B70) */
    void                    *start;                  /* 0x0038, RAM start address to use. */
    z2_player_ovl_table_t   *selected;               /* 0x003C, points to selected overlay. */
} z2_0x801D0B70_t;                                   /* 0x0040 */

/// =============================================================
/// Defines & Prototypes
/// =============================================================

/* Virtual File Addresses */
#define z2_item_texture_file             0xA36C10

/* Data Addresses */
#define z2_arena_addr                    0x8009CD20
#define z2_file_table_addr               0x8009F8B0
#define z2_gamestate_addr                0x801BD910
#define z2_item_segaddr_table_addr       0x801C1E6C /* Segment address table used for item textures. */
#define z2_object_table_addr             0x801C2740
#define z2_song_notes_addr               0x801CFC98
#define z2_file_addr                     0x801EF670
#define z2_game_arena_addr               0x801F5100
#define z2_segment_addr                  0x801F8180
#define z2_static_ctxt_addr              0x803824D0
