#ifndef Z64_H
#define Z64_H

#include <n64.h>
#include <stdint.h>
#include "color.h"

#define Z64_SCREEN_WIDTH         320
#define Z64_SCREEN_HEIGHT        240

#define Z64_TATL_NONE            0 // Tatl is not present
#define Z64_TATL_NORMAL          1

#define Z64_TIMESPEED_NORMAL     0
#define Z64_TIMESPEED_INVERTED   0xFFFFFFFE
#define Z64_TIMESPEED_STOP       0xFFFFFFFD

#define Z64_SAVETYPE_SONGOFTIME  0
#define Z64_SAVETYPE_OWL         1

#define Z64_MAGIC_NONE           0
#define Z64_MAGIC_NORMAL         0x30
#define Z64_MAGIC_FULL           0x60

#define IS_TRANSFORMATION_MASK(MASK)   \
    ((MASK) == Z64_ITEM_DEKU_MASK   || \
     (MASK) == Z64_ITEM_GORON_MASK  || \
     (MASK) == Z64_ITEM_ZORA_MASK   || \
     (MASK) == Z64_ITEM_FIERCE_DEITY_MASK)

/// Correlates to form field in z64_file_t.
typedef enum
{
    Z64_FORM_FIERCE_DEITY,
    Z64_FORM_GORON,
    Z64_FORM_ZORA,
    Z64_FORM_DEKU,
    Z64_FORM_CHILD,
} z64_form_t;

typedef enum
{
    // 0x00 (Inventory)
    Z64_ITEM_OCARINA,
    Z64_ITEM_BOW,
    Z64_ITEM_FIRE_ARROW,
    Z64_ITEM_ICE_ARROW,
    Z64_ITEM_LIGHT_ARROW,
    Z64_ITEM_FAIRY_OCARINA,
    Z64_ITEM_BOMB,
    Z64_ITEM_BOMBCHU,
    Z64_ITEM_DEKU_STICK,
    Z64_ITEM_DEKU_NUT,
    Z64_ITEM_MAGIC_BEAN,
    Z64_ITEM_SLINGSHOT,
    Z64_ITEM_POWDER_KEG,
    Z64_ITEM_PICTOGRAPH,
    Z64_ITEM_LENS,
    Z64_ITEM_HOOKSHOT,
    Z64_ITEM_FAIRY_SWORD,
    Z64_ITEM_HOOKSHOT_OOT,

    // 0x12 (Bottle)
    Z64_ITEM_EMPTY_BOTTLE,
    Z64_ITEM_RED_POTION,

    Z64_CAMERA_STATE_CIRCLE7,
    Z64_CAMERA_STATE_CHUBOSS,
    Z64_CAMERA_STATE_RFIXED1,
    Z64_CAMERA_STATE_TRESURE1,
    Z64_CAMERA_STATE_BOMBBASKET,
    Z64_CAMERA_STATE_CIRCLE8,
    Z64_CAMERA_STATE_FUKAN1,
    Z64_CAMERA_STATE_DUNGEON3,
    Z64_CAMERA_STATE_TELESCOPE,
    Z64_CAMERA_STATE_ROOM0,
    Z64_CAMERA_STATE_RCIRC0,
    Z64_CAMERA_STATE_CIRCLE9,
    Z64_CAMERA_STATE_ONTHEPOLE,
    Z64_CAMERA_STATE_INBUSH,
    Z64_CAMERA_STATE_BOSS_LAST,
    Z64_CAMERA_STATE_BOSS_INI,
    Z64_CAMERA_STATE_BOSS_HAK,
    Z64_CAMERA_STATE_BOSS_KON,
    Z64_CAMERA_STATE_CONNECT0,
    Z64_CAMERA_STATE_MORAY,
    Z64_CAMERA_STATE_NORMAL2,
    Z64_CAMERA_STATE_BOMBBOWL,
    Z64_CAMERA_STATE_CIRCLEa,
    Z64_CAMERA_STATE_WHIRLPOOL,
    Z64_CAMERA_STATE_KOKKOGAME,
    Z64_CAMERA_STATE_GIANT,
    Z64_CAMERA_STATE_SCENE0,
    Z64_CAMERA_STATE_ROOM1,
    Z64_CAMERA_STATE_WATER2,
    Z64_CAMERA_STATE_SOKONASI,
    Z64_CAMERA_STATE_FORCEKEEP,
    Z64_CAMERA_STATE_PARALLEL1,
    Z64_CAMERA_STATE_START1,
    Z64_CAMERA_STATE_ROOM2,
    Z64_CAMERA_STATE_NORMAL4,
    Z64_CAMERA_STATE_SHELL,
    Z64_CAMERA_STATE_DUNGEON4,
} z64_camera_state;

// Source: https://wiki.cloudmodding.com/mm/Notes:Mini-Cutscenes#MM_.28J.29_addresses:_Camera_assembly_stuff
typedef enum {
    Z64_CAMERA_MODE_NORMAL,
    Z64_CAMERA_MODE_JUMP,
    Z64_CAMERA_MODE_GORONDASH,
    Z64_CAMERA_MODE_NUTSSHOT,
    Z64_CAMERA_MODE_BOWARROWZ,
    Z64_CAMERA_MODE_NUTSFLY,
    Z64_CAMERA_MODE_SUBJECT,
    Z64_CAMERA_MODE_BOOKEEPON,
    Z64_CAMERA_MODE_ZORAFIN,
    Z64_CAMERA_MODE_KEEPON,
    Z64_CAMERA_MODE_PARALLEL,
    Z64_CAMERA_MODE_TALK,
    Z64_CAMERA_MODE_PACHINCO,
    Z64_CAMERA_MODE_BOWARROW,
    Z64_CAMERA_MODE_BATTLE,
    Z64_CAMERA_MODE_NUTSHIDE,
    Z64_CAMERA_MODE_STILL,
    Z64_CAMERA_MODE_CHARGE,
    Z64_CAMERA_MODE_CLIMB,
    Z64_CAMERA_MODE_CLIMBZ,
    Z64_CAMERA_MODE_FOOKSHOT,
    Z64_CAMERA_MODE_FREEFALL,
    Z64_CAMERA_MODE_HANG,
    Z64_CAMERA_MODE_HANGZ,
    Z64_CAMERA_MODE_PUSHPULL,
    Z64_CAMERA_MODE_NUTSFLYZ,
    Z64_CAMERA_MODE_GORONJUMP,
    Z64_CAMERA_MODE_BOOMERANG,
    Z64_CAMERA_MODE_CHARGEZ,
    Z64_CAMERA_MODE_ZORAFINZ,
} z64_camera_mode;

typedef enum {
    // No timer.
    Z64_TIMER_STATE_NONE,
    // Timer is not being displayed yet.
    Z64_TIMER_STATE_PRE,
    // Timer is in middle of screen.
    Z64_TIMER_STATE_INIT,
    // Timer is moving into position.
    Z64_TIMER_STATE_MOVING,
    // Timer is positioned.
    Z64_TIMER_STATE_SET,
    // Timer is finished and no longer displaying.
    Z64_TIMER_STATE_FINISHED,
} z64_timer_state_t;

/* Macro for checking if a timer state is visible. */
#define IS_TIMER_VISIBLE(TSTATE) (Z64_TIMER_STATE_INIT <= (TSTATE) && (TSTATE) < Z64_TIMER_STATE_FINISHED)

typedef enum {
    // Skull kid on clock tower.
    Z64_TIMER_TYPE_SKULL_KID = 3,
    // Treasure chest game, maybe others.
    Z64_TIMER_TYPE_TCG = 4,
    // Drowning.
    Z64_TIMER_TYPE_DROWNING = 5,
    // None.
    Z64_TIMER_TYPE_NONE = 0x63,
} z64_timer_type_t;

typedef struct
{
  int16_t x;                               // 0x0000
  int16_t y;                               // 0x0002
  int16_t z;                               // 0x0004
} z64_xyz_t;                               // 0x0006

typedef struct
{
  float x;                                 // 0x0000
  float y;                                 // 0x0004
  float z;                                 // 0x0008
} z64_xyzf_t;                              // 0x000C

typedef uint16_t z64_angle_t;
typedef struct
{
  z64_angle_t x;                           // 0x0000
  z64_angle_t y;                           // 0x0002
  z64_angle_t z;                           // 0x0004
} z64_rot_t;                               // 0x0006

typedef union
{
  struct
  {
    uint16_t  a  : 1;
    uint16_t  b  : 1;
    uint16_t  z  : 1;
    uint16_t  s  : 1;
    uint16_t  du : 1;
    uint16_t  dd : 1;
    uint16_t  dl : 1;
    uint16_t  dr : 1;
    uint16_t     : 2;
    uint16_t  l  : 1;
    uint16_t  r  : 1;
    uint16_t  cu : 1;
    uint16_t  cd : 1;
    uint16_t  cl : 1;
    uint16_t  cr : 1;
  };
  uint16_t    pad;                         // 0x0000
} pad_t;                                   // 0x0002

typedef struct
{
  pad_t         pad;                       // 0x0000
  int8_t        x;                         // 0x0002
  int8_t        y;                         // 0x0003
} z64_controller_t;                        // 0x0004

typedef struct
{
  z64_controller_t  raw;                   // 0x0000
  uint16_t          unk_00_;               // 0x0004
  z64_controller_t  raw_prev;              // 0x0006
  uint16_t          unk_01_;               // 0x000A
  pad_t             pad_pressed;           // 0x000C
  int8_t            x_diff;                // 0x000E
  int8_t            y_diff;                // 0x000F
  char              unk_02_[0x0002];       // 0x0010
  pad_t             pad_released;          // 0x0012
  int8_t            adjusted_x;            // 0x0014
  int8_t            adjusted_y;            // 0x0015
  char              unk_03_[0x0002];       // 0x0016
} z64_input_t;                             // 0x0018

typedef struct
{
    uint32_t        size;                  // 0x0000
    Gfx            *buf;                   // 0x0004
    Gfx            *p;                     // 0x0008
    Gfx            *d;                     // 0x000C
} z64_disp_buf_t;

// Partially copying struct from OoT, but tweaked (most fields not verified)
typedef struct
{
    Gfx            *poly_opa_w;            // 0x0000
    Gfx            *poly_xlu_w;            // 0x0004
    char            unk_08_[0x0008];       // 0x0008
    Gfx            *overlay_w;             // 0x0010
    char            unk_14_[0x00A4];       // 0x0014
    Gfx            *work_c;                // 0x00B8
    uint32_t        work_c_size;           // 0x00BC
    char            unk_C0_[0x00F0];       // 0x00C0
    Gfx            *work_w;                // 0x01B0
    z64_disp_buf_t  work;                  // 0x01B4
    char            unk_1C4_[0x00D4];      // 0x01C4, 0x10 bytes less than OoT?
    z64_disp_buf_t  overlay;               // 0x0298
    z64_disp_buf_t  poly_opa;              // 0x02A8
    z64_disp_buf_t  poly_xlu;              // 0x02B8
    uint32_t        frame_count_1;         // 0x02C8
    void           *frame_buffer;          // 0x02CC
    char            unk_2D0_[0x0008];      // 0x02D0
    uint32_t        frame_count_2;         // 0x02D8
    // void           *func_ptr;           // 0x02DC
    // z64_ctxt_t     *ctxt;               // 0x02E0
} z64_gfx_t;

typedef struct
{
    uint8_t unk_00_[0x7C];                 // 0x0000
    void *ctxt;                            // 0x007C
    void *link;                            // 0x0080
    uint8_t unk_84_[0xBC];                 // 0x0084
    int16_t unk_140_;                      // 0x0140
    int16_t state;                         // 0x0142
    int16_t mode;                          // 0x0144
    int16_t unk_146_;                      // 0x0146
    int16_t unk_148_;                      // 0x0148
    int16_t unk_14A_;                      // 0x014A
    int16_t flag_14C;                      // 0x014C
    uint8_t unk_14E_[0x2A];                // 0x014E
} z64_camera_t;                            // 0x0178

typedef struct
{
    z64_gfx_t      *gfx;                   // 0x0000
    void           *state_main;            // 0x0004
    void           *state_dtor;            // 0x0008
    void           *next_ctor;             // 0x000C
    uint32_t        next_size;             // 0x0010
    z64_input_t     input[4];              // 0x0014
    uint32_t        state_heap_size;       // 0x0074
    void           *state_heap;            // 0x0078
    void           *heap_start;            // 0x007C
    void           *heap_end;              // 0x0080
    void           *state_heap_node;       // 0x0084
    char            unk_00_[0x0010];       // 0x0088
    int32_t         state_continue;        // 0x0098
    int32_t         state_frames;          // 0x009C
    uint32_t        unk_01_;               // 0x00A0
                                           // 0x00A4
} z64_ctxt_t;

typedef struct
{
    uint8_t  unk_0_[0x226];                // 0x0000
    uint16_t heartbeat_timer;              // 0x0226
    uint16_t heartbeat_mode;               // 0x0228
    z64_color_rgb16_t heartbeat_inner_rgb; // 0x022A
    z64_color_rgb16_t heartbeat_outer_rgb; // 0x0230
    z64_color_rgb16_2_t heart_inner_rgb;   // 0x0236
    z64_color_rgb16_2_t heart_outer_rgb;   // 0x0242
    uint8_t  unk_24E_[0x18];               // 0x024E
    uint16_t a_button_alpha;               // 0x0266
    uint16_t b_button_alpha;               // 0x0268
    uint16_t c_left_button_alpha;          // 0x026A
    uint16_t c_down_button_alpha;          // 0x026C
    uint16_t c_right_button_alpha;         // 0x026E
    uint16_t hearts_alpha;                 // 0x0270
    uint16_t rupees_alpha;                 // 0x0272, also magic meter alpha
    uint16_t minimap_alpha;                // 0x0274
} z64_game_sub_169E8;

typedef struct
{
    uint8_t unk_0_[0x875];                 // 0x0000
    uint8_t flag_875;                      // 0x0875
    uint8_t unk_876_[0x2D4];               // 0x0876
    uint8_t flag_B4A;                      // 0x0B4A
} z64_game_sub_18000;

typedef struct
{
    z64_ctxt_t         common;             // 0x00000
    uint16_t           scene_number;       // 0x000A4
    uint8_t            scene_code_index;   // 0x000A6
    uint8_t            unk_A7_[0x179];     // 0x000A7
    z64_camera_t       cameras[4];         // 0x00220
    uint8_t            unk_800_[0x14A0];   // 0x00800
    uint8_t            unk_1CA0_;          // 0x01CA0
    uint8_t            unk_1CA1_[0x14D47]; // 0x01CA1
    z64_game_sub_169E8 sub_169E8;          // 0x169E8
    uint8_t            unk_16C5E_[0x13A2]; // 0x16C5E
    z64_game_sub_18000 sub_18000;          // 0x18000
} z64_game_t;

// Note: Currently comparing two separate sources:
//
// - https://wiki.cloudmodding.com/mm/Notes/Deathbasket - N64 version, see "current file stuff"
// - https://www.zeldacodes.org/addresses/mm-u - Likely VC version
//
// Deathbasket's base address is likely what we want: 0x801EF670 (corresponding VC addr is *probably* 0x8110C750)
// Both sets of notes seem to fill in some blanks for each other.
typedef struct
{
    uint32_t entrance;           // 0x0000
    uint8_t unk_04_;             // 0x0004, tatl hint type?
    uint8_t unk_05_;             // 0x0005
    uint8_t unk_06_[4];          // 0x0006
    uint16_t cutscene_flag;      // 0x000A, 0xFFFD if in cutscene?
    uint16_t time_tick;          // 0x000C
    uint8_t unk_0E_[6];          // 0x000E
    uint32_t time_speed;         // 0x0014
    uint16_t time;               // 0x0018
    uint8_t unk_1A_[6];          // 0x001A
    uint8_t form;                // 0x0020
    uint8_t unk_21_;             // 0x0021
    uint8_t tatl_flag;           // 0x0022
    uint8_t save_type;           // 0x0023
    uint8_t zelda3[8];           // 0x0024, "ZELDA3\0\0"
    uint8_t filename[8];         // 0x002C
    uint16_t hearts;             // 0x0034
    uint16_t health;             // 0x0036
    uint8_t has_magic;           // 0x0038, some sort of "has magic" flag
    uint8_t magic;               // 0x0039, current magic amount
    uint16_t rupees;             // 0x003A
    uint32_t playtime;           // 0x003C, play-time frame counter
    uint8_t reset_magic;         // 0x0040
    uint8_t unk_41_;             // 0x0041
    uint8_t double_defense;      // 0x0042
    uint8_t unk_43_[3];          // 0x0043
    union {
        uint16_t owl_statues;    // 0x0046
        struct {
            uint16_t great_bay        : 1;
            uint16_t zora_cape        : 1;
            uint16_t snowhead         : 1;
            uint16_t mountain_village : 1;
            uint16_t clock_town       : 1;
            uint16_t milk_road        : 1;
            uint16_t woodfall         : 1;
            uint16_t southern_swamp   : 1;
            uint16_t ikana_canyon     : 1;
            uint16_t stone_tower      : 1;
            uint16_t                  : 5;
            uint16_t west_clock_town  : 1;
        };
    };
    uint8_t unk_48_[4];          // 0x0048
    uint8_t b_button;            // 0x004C
    uint8_t c_buttons[3];        // 0x004D
    uint8_t goron_b_button;      // 0x0050
    uint8_t unk_51_[3];          // 0x0051
    uint8_t zora_b_button;       // 0x0054
    uint8_t unk_55_[3];          // 0x0055
    uint8_t deku_b_button;       // 0x0058
    uint8_t unk_59_[4];          // 0x0059
    uint8_t alt_c_buttons[3];    // 0x005D
    uint8_t unk_60_[0xD];        // 0x0060
    union {
        uint8_t flag_6D;         // 0x006D
        struct {
            uint8_t sword  : 4;
            uint8_t shield : 4;
        };
    };
    uint8_t unk_6E_[2];          // 0x006E
    union {
        uint8_t inventory[0x30]; // 0x0070
        struct {
            uint8_t items[0x18]; // 0x0070
            uint8_t masks[0x18]; // 0x0088
        };
    };
    uint8_t item_count[0x18];    // 0x00A0
    uint8_t unk_B8_[2];          // 0x00B8
    union {
        uint8_t flag_BA;         // 0x00BA
        struct {
            uint8_t        : 2;
            uint8_t wallet : 2;  // 0 = child, 1 = adult, 2 = giant
            uint8_t        : 4;
        };
    };
    union {
        uint8_t flag_BB;         // 0x00BB
        struct {
            uint8_t quiver   : 3;
            uint8_t bomb_bag : 2;
            uint8_t          : 3;
        };
    };
    union {
        uint8_t flag_BC;         // 0x00BC
        struct {
            uint8_t lullaby_intro : 4;
            uint8_t heart_pieces  : 4;
        };
    };
    union {
        uint8_t flag_BD;         // 0x00BD
        struct {
            uint8_t song_of_storms   : 1;
            uint8_t                  : 1;
            uint8_t bombers_notebook : 1;
            uint8_t                  : 5;
        };
    };
    union {
        uint8_t flag_BE;         // 0x00BE
        struct {
            uint8_t new_wave_bossa_nova : 1;
            uint8_t elegy_of_emptiness  : 1;
            uint8_t oath_to_order       : 1;
            uint8_t                     : 1;
            uint8_t song_of_time        : 1;
            uint8_t song_of_healing     : 1;
            uint8_t eponas_song         : 1;
            uint8_t song_of_soaring     : 1;
        };
    };
    union {
        uint8_t flag_BF;         // 0x00BF
        struct {
            uint8_t odolwa_remains      : 1;
            uint8_t goht_remains        : 1;
            uint8_t gyorg_remains       : 1;
            uint8_t twinmold_remains    : 1;
            uint8_t                     : 2;
            uint8_t sonata_of_awakening : 1;
            uint8_t goron_lullaby       : 1;
        };
    };
    uint8_t unk_C0_[0xA];        // 0x00C0
    uint8_t small_keys[4];       // 0x00CA
    uint8_t unk_CE_[5];          // 0x00CE
    uint8_t doubled_hearts;      // 0x00D3
    uint8_t unk_D4_[0xE0A];      // 0x00D4
    uint16_t bank_rupees;        // 0x0EDE
    uint8_t unk_EE0_[0x10];      // 0x0EE0
    uint32_t lottery_guess;      // 0x0EF0
    uint8_t unk_EF4_[0x12];      // 0x0EF4
    union {
        uint8_t flag_F06;        // 0x0F06
        struct {
            uint8_t                : 4;
            uint8_t infinite_magic : 1;
            uint8_t                : 3;
        };
    };
    uint8_t unk_F07_[0x8];       // 0x0F07
    uint8_t great_spin;          // 0x0F0F
    uint8_t unk_F10[0x4C];       // 0x0F10
    uint32_t locations_visited;  // 0x0F5C
    uint8_t unk_F60[0x7C];       // 0x0F60
    uint8_t lotteries[9];        // 0x0FDC
    uint8_t unk_FE5_[6];         // 0x0FE5
    uint8_t bomber_code[5];      // 0x0FEB
    uint8_t unk_FF0_[0x26];      // 0x0FF0
    uint16_t jinx_timer;         // 0x1016
    int16_t rupee_timer;         // 0x1018
    uint8_t unk_101A_[0x2DB6];   // 0x101A
    uint8_t timer_state[0x40];   // 0x3DD0
    uint8_t unk_3E10_[0x108];    // 0x3E10‬
    uint8_t b_button_usable;     // 0x3F18
    uint8_t c_buttons_usable[3]; // 0x3F19
    uint8_t a_button_usable;     // 0x3F1C
    uint8_t unk_3F1D_[3];        // 0x3F1D
    uint16_t pre_game_state;     // 0x3F20, game state in relation to alpha transition?
    uint16_t game_state;         // 0x3F22
    uint16_t alpha_transition;   // 0x3F24
    uint16_t sub_game_state;     // 0x3F26, might be "previous" game state but not sure
    uint8_t unk_3F28_[0x6];      // 0x3F28
    uint16_t magic_meter_size;   // 0x3F2E
    uint8_t unk_3F30_[0x19A8];   // 0x3F30
    z64_color_rgb16_t heart_dd_beating_rgb; // 0x58D8
    uint8_t unk_58DE_[0x12];                // 0x58DE
    z64_color_rgb16_t heart_dd_rgb;         // 0x58F0
} z64_file_t;

typedef struct
{
    struct
    {
        uint8_t damage : 4;
        uint8_t effect : 4;
    } attack[0x20];
} z64_actor_damage_table_t;

typedef struct z64_actor_s z64_actor_t;

/* actor callback prototypes */
typedef void (*z64_ActorMain_proc)(z64_actor_t *actor, z64_game_t *game);
typedef void (*z64_ActorDraw_proc)(z64_actor_t *actor, z64_game_t *game);

// Source: https://wiki.cloudmodding.com/mm/Actors
struct z64_actor_s
{
    uint16_t                 id;                     // 0x0000, Actor Id.
    uint8_t                  type;                   // 0x0002, Actor Type. See Below
    uint8_t                  room;                   // 0x0003, Room number the actor is part of. FF denotes that the actor won't despawn on a room change
    int32_t                  flags;                  // 0x0004, flags used for drawing stuff?
                                                     // & 0x0040 0000 = Affects actor lighting
                                                     // & 0x0000 1000 = ?
                                                     // & 0x0000 0040 = ?
    z64_xyzf_t                pos1;                  // 0x0008, Related to collision detection routine
    z64_rot_t                 init_rot;              // 0x0014, Initial Rotation when spawned
    uint16_t                  unk_1A_;               // 0x001A
    uint16_t                  variable;              // 0x001C, Configurable variable set by an actor's spawn data
    int8_t                    obj_table_index;       // 0x001E, index to table at Global Context + ????
    uint8_t                   unk_1F_;               // 0x001F
    uint16_t                  sound_effect;          // 0x0020, Plays sound effect relative to actor's location (if within range of camera?)
    uint16_t                  unk_22_;               // 0x0022
    z64_xyzf_t                position;              // 0x0024, Current coordinates
    z64_rot_t                 speed_rot;             // 0x0030, 0x32 sets what direction the 0x68 speedXZ variable is moving the actor
    uint16_t                  unk_36_;               // 0x0036, same as 0x1A
    int8_t                    unk_38_;               // 0x0038
    uint8_t                   unk_39_;               // 0x0039
    uint16_t                  unk_3A_;               // 0x003A
    z64_xyzf_t                pos3;                  // 0x003C, Related to camera
    z64_rot_t                 rot1;                  // 0x0048, 0x30 rotation copied into here
    uint16_t                  unk_4E_;               // 0x004E
    int32_t                   unk_50_;               // 0x0050
    float                     unk_54_;               // 0x0054, I know this is a float from breakpointing it
    z64_xyzf_t                scale;                 // 0x0058, sets x,y,z scaling factor. Typically, a factor of 0.01 is used for each axis
    z64_xyzf_t                velocity;              // 0x0064
    float                     speedXZ;               // 0x0070, Always positive, stores how fast the actor is traveling along the XZ plane
    float                     gravity;               // 0x0074, acceleration due to gravity; value is added to Y velocity every frame
    float                     min_velocity_y;        // 0x0078, sets the lower bounds cap on velocity along the Y axis struct, collision related
    int*                      wall_poly;             // 0x007C, Wall polygon an actor is touching
    int*                      floor_poly;            // 0x0080, Floor polygon an actor is over/touching
    uint8_t                   wall_poly_src;         // 0x0084, Complex Poly Surface Source. 0x32 = Scene
    uint8_t                   floor_poly_src;        // 0x0085, Complex Poly Surface Source. 0x32 = Scene
    uint16_t                  wallrot;               // 0x0086
    float                     unk_88_;               // 0x0088, floor poly height?
    float                     water_surface_dist;    // 0x008C
    uint16_t                  bgcheck_flags;         // 0x0090, unknown
    int16_t                   unk_roty;              // 0x0092, rotation y (give item, possibly next facing dir?/face toward link?)
    float                     _unk_94;               // 0x0094
    float                     xz_distance_from_link; // 0x0098
    float                     y_distance_from_link;  // 0x009C, relative distance

    // 8-10-2012 : Addition made by Jason777
    // For actors which contain a damage chart (example: Stalfos)...
    z64_actor_damage_table_t* damage_table;          // 0x00A0, Pointer to the actor's Damage Chart in RAM.
    z64_xyzf_t                displacement;          // 0x00A4, amount to correct velocity (0x5C) by when colliding into a body
    int16_t                   unk_B0_;               // 0x00B0
    int16_t                   unk_B2_;               // 0x00B2
    uint16_t                  unk_B4_;               // 0x00B4
    uint8_t                   mass;                  // 0x00B6, Used to compute displacement, 50 is common value, 0xFF for infinite mass/unmoveable
    uint8_t                   health;                // 0x00B7
    uint8_t                   damage;                // 0x00B8
    uint8_t                   damage_effect;         // 0x00B9, Stores what effect should occur when hit by a weapon
    uint8_t                   impact_effect;         // 0x00BA
    uint8_t                   unk_BB_;               // 0x00BB

    z64_rot_t                 rot_2;                 // 0x00BC, Setting this immediately changes actor's rotation
    uint8_t                   unk_C2_[0x53];         // 0x00C2
    uint8_t                   run_actor;             // 0x0115, Determines if actor instance should be processed. 01 for yes, 00 for no.
    uint8_t                   unk_116_[0x12];        // 0x0116
    z64_actor_t*              actor_prev;            // 0x0128, Previous z_ram_actor of this type
    z64_actor_t*              actor_next;            // 0x012C, Next z_ram_actor of this type
    void*                     Init;                  // 0x0130, Actor Constructor?
    void*                     Dest;                  // 0x0134, Actor Deconstructor?
    z64_ActorMain_proc        Main;                  // 0x0138
    z64_ActorDraw_proc        Draw;                  // 0x013C
    void*                     CodeEntry;             // 0x0140, Address to source overlay file's reference in code (file)
    // ?
    // From here on, the structure and size varies for each actor
};

typedef struct {
    z64_actor_t common;         // 0x0000
    uint8_t unk_144_[0x116];    // 0x0144
    uint16_t anim_timer;        // 0x025A, counts from 0 to 0x5F as "fairy heal" animation progresses
} z64_fairy_actor_t;

typedef struct {
    z64_actor_t common;         // 0x0000
    uint8_t unk_144_[2];        // 0x0144
    uint8_t pre_use;            // 0x0146
    uint8_t unk_147_[3];        // 0x0147
    uint8_t item_out;           // 0x014A, which item Link currently has out?
                                // 0x14 = Ocarina, 0x15 = Bottle, 0x9 = Bow, 0xD = Hookshot
    uint8_t form;               // 0x014B
    uint8_t unk_14C_[7];        // 0x014C
    uint8_t mask;               // 0x0153
    uint8_t mask_c;             // 0x0154, C button index (starting at 1) of current/recently worn mask
    uint8_t previous_mask;      // 0x0155
    uint8_t unk_156_[0x916];    // 0x0156
    uint32_t action_state1;     // 0x0A6C
    uint32_t action_state2;     // 0x0A70
    uint32_t action_state3;     // 0x0A74
    uint8_t unk_A78_[0x6F];     // 0x0A78
    uint8_t anim_timer;         // 0x0AE7, some animation timer? Relevant to: transformation masks, freezing, etc
    uint16_t frozen_timer;      // 0x0AE8
    uint8_t unk_AEA_[0x88];     // 0x0AEA
    uint16_t floor_type;        // 0x0B72, determines sound effect used while walking
} z64_link_t;

typedef struct {
    void               *ram;                    /* 0x0000 */
    uint32_t            vrom_start;             /* 0x0004 */
    uint32_t            vrom_end;               /* 0x0008 */
    uint32_t            vram_start;             /* 0x000C */
    uint32_t            vram_end;               /* 0x0010 */
    char                unk_0x14[4];            /* 0x0014 */
    char               *filename;               /* 0x0018 */
} z64_player_ovl_table_t;                       /* 0x001C */

typedef struct
{
    int16_t     unk_00_;        // 0x0000
    int16_t     unk_02_;        // 0x0002
    int16_t     unk_04_;        // 0x0004
    int16_t     unk_06_;        // 0x0006
    uint32_t    unk_08_;        // 0x0008
    uint32_t    unk_0C_;        // 0x000C
    z64_game_t *game;           // 0x0010
    int16_t     unk_14_;        // 0x0014
    int16_t     unk_16_;        // 0x0016
} z64_0x801BD8B0_t;

typedef struct {
    z64_player_ovl_table_t  pause_ovl;          /* 0x0000, VRAM: [0x808160A0, 0x8082DA90) */
    z64_player_ovl_table_t  player_ovl;         /* 0x001C, VRAM: [0x8082DA90, 0x80862B70) */
    void                   *start;              /* 0x0038, RAM start address to use. */
    z64_player_ovl_table_t *selected;           /* 0x003C, points to selected overlay. */
} z64_0x801D0B70_t;                             /* 0x0040 */

typedef struct {
    union {
        uint16_t digits[8];                     /* 0x0000 */
        struct {
            uint16_t minutes[2];                /* 0x0000 */
            uint16_t colon1;                    /* 0x0004 */
            uint16_t seconds[2];                /* 0x0006 */
            uint16_t colon2;                    /* 0x000A */
            uint16_t milliseconds[2];           /* 0x000C */
            uint16_t beep_seconds;              /* 0x0010, previous seconds[1] value that had a beep. */
                                                /*         Likely used to determine when to do the next beep. */
        };
    };
} z64_timer_digits_t;                           /* 0x0012 */

// virtual file addresses
#define z64_item_texture_file             0xA36C10

// dram addresses
#define z64_file_addr                     0x801EF670
#define z64_ctxt_addr                     0x803E6B20
#define z64_game_addr                     z64_ctxt_addr
#define z64_link_addr                     0x803FFDB0

// data
#define z64_ctxt                          (*(z64_ctxt_t*) z64_ctxt_addr)
#define z64_file                          (*(z64_file_t*) z64_file_addr)
#define z64_game                          (*(z64_game_t*) z64_game_addr)
#define z64_link                          (*(z64_link_t*) z64_link_addr)

// data (unknown)
